app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.search (params[:search])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."contact" = ? LIMIT ?  [["contact", ""], ["LIMIT", 1]]

  def create
    @contact = current_user.contact.build(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("fname", "lname", "email", "phone", "instagram", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "instagram" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["instagram", "mellow14"], ["updated_at", "2022-04-05 06:25:33.522128"], ["id", 1]]

  def correct_user
    @contact = current_user.contact.find_by(id: params[:id]) #the correct user is the current user that has been associated with the userid
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ? AND "contacts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]