app/controllers/review_comments_controller.rb

  def create
    @review_comment = ReviewComment.new(review_comment_params)

    respond_to do |format|
      if @review_comment.save
---
INSERT INTO "review_comments" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Good"], ["body", "This app is good for managing my contacts"], ["created_at", "2022-04-10 00:34:25.873390"], ["updated_at", "2022-04-10 00:34:25.873390"]]

    def set_review_comment
      @review_comment = ReviewComment.find(params[:id])
---
SELECT "review_comments".* FROM "review_comments" WHERE "review_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]