app/models/contact.rb

	def self.search(search)
		if search
			contact = Contact.find_by(fname: search)
			if Contact
				self.where(userId: Contact)
			else
				Contact.all
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."fname" = ? LIMIT ?  [["fname", ""], ["LIMIT", 1]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."contact" = ? LIMIT ?  [["contact", ""], ["LIMIT", 1]]