app/models/user.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "emailtype" = ? WHERE "users"."id" = ?  [["updated_at", "2022-04-09 16:59:38.000091"], ["emailtype", "Free Email Account"], ["id", 5]]
UPDATE "users" SET "updated_at" = ?, "emailtype" = ? WHERE "users"."id" = ?  [["updated_at", "2022-04-09 16:54:18.638302"], ["emailtype", "Unknown Email Account"], ["id", 4]]
---
def emailtypes
    require 'EmailType'
    user = User.last
    result = EmailType.emailchk(email)
    if result == 'Free email'
    user.update(emailtype: "Free Email Account")
    elsif result == 'Business email'
    user.update(emailtype: "Business Email Account")
    else
    user.update(emailtype: "Unknown Email Account")

SELECT 1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."id" != ? LIMIT ?  [["email", "unknown email account"], ["id", 4], ["LIMIT", 1]]
---
def CustomgemCM
  return unless email.present?